###############################################################################
# Created by write_sdc
# Wed Mar 27 13:49:21 2024
###############################################################################
current_design picorv32
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name core_clock -period 100.0000 [get_ports {clk}]
set_propagated_clock [get_clocks {core_clock}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
